# Status Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksharedOperationProgressChangedEventArgs..::..Status Property
WorksharedOperationProgressChangedEventArgs Class See Also
---
Gets API event status, reflect current operation execution status.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public RevitAPIEventStatus Status { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Status As RevitAPIEventStatus
	Get
```

Visual C++
---
```text
public:
property RevitAPIEventStatus Status {
	RevitAPIEventStatus get ();
}
```

# See Also
WorksharedOperationProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace